{"backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "dtype": "float32", "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "kernel_size": [5, 5], "filters": 20}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "filters": 50, "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [5, 5], "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "units": 500, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "name": "dense_1", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "units": 10, "activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "trainable": true, "name": "dense_2", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "softmax"}}]}